app/views/projects/_skill_checkboxes.html.erb

SELECT 1 FROM "skills" INNER JOIN "project_skills" ON "skills"."id" = "project_skills"."skill_id" WHERE "project_skills"."project_id" IS NULL AND "skills"."id" = 3 LIMIT 1
---
	  <% for skill in @skills  %>
	   <%= check_box_tag "project[skill_ids][]", skill.id, @project.skills.include?(skill) %>