app/controllers/projects_controller.rb

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."project_id" = 1
---
  def show
    @project = Project.find(params[:id])

SELECT "skills".* FROM "skills"
---
  def new
    @project = Project.new

    # Builds 3 attachment forms on the new project page
    #3.times {@project.attachments.build}

    @skills = Skill.all

SELECT "skills".* FROM "skills"
INSERT INTO "projects" ("active", "created_at", "creator_id", "description", "end_date", "hours_per_week", "name", "photo", "start_date", "team_size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(params[:project])
    @skills = Skill.all
    if current_user
    	@project.creator_id = current_user.id
	end

    if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "skills".* FROM "skills"
---
  def edit
    @project = Project.find(params[:id])
    @skills = Skill.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "skills".* FROM "skills"
UPDATE "projects" SET "start_date" = '2011-11-20', "end_date" = '2011-11-20', "updated_at" = '2011-11-17 05:51:04.828000' WHERE "projects"."id" = 4
---
  def update
    @project = Project.find(params[:id])
    @skills = Skill.all
    if @project.update_attributes(params[:project])