app/controllers/projects_controller.rb

SELECT "skills".* FROM "skills"
---
  def show
    @project = Project.find(params[:id])
    #@attachments = @project.attachments
    @skills = Skill.all