app/controllers/skills_controller.rb

SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @skill = Skill.find(params[:id])

INSERT INTO "skills" ("created_at", "description", "level", "name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @skill = Skill.new(params[:skill])
    if @skill.save

SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @skill = Skill.find(params[:id])

SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "skills" SET "updated_at" = '2011-12-14 21:11:55.072228', "level" = 8 WHERE "skills"."id" = 1
---
  def update
    @skill = Skill.find(params[:id])
    if @skill.update_attributes(params[:skill])

SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "skills" WHERE "skills"."id" = ?  [["id", 3]]
---
  def destroy
    @skill = Skill.find(params[:id])
    @skill.destroy