app/controllers/user_skills_controller.rb

INSERT INTO "user_skills" ("created_at", "skill_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 11 Dec 2011 20:52:03 UTC +00:00], ["skill_id", 1], ["updated_at", Sun, 11 Dec 2011 20:52:03 UTC +00:00], ["user_id", 1]]
---
def create
  @user_skill = UserSkill.new(params[:user_skill])
  @user_skill.user_id = params[:user_id]
  @user_skill.skill_id = params[:skill_id]
  if @user_skill.save

SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = 2
---
def index
  @user_skills = UserSkill.all

SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."id" = ? LIMIT 1  [["id", "1"]]
---
def show
  @user_skill = UserSkill.find(params[:id])

SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "user_skills" WHERE "user_skills"."id" = ?  [["id", 1]]
---
def destroy
  @user_skill = UserSkill.find(params[:id])
  @user_skill.destroy