app/controllers/user_projects_controller.rb

INSERT INTO "user_projects" ("created_at", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 11 Dec 2011 21:16:59 UTC +00:00], ["project_id", 1], ["updated_at", Sun, 11 Dec 2011 21:16:59 UTC +00:00], ["user_id", 1]]
---
def create
  @user_project = UserProject.new(params[:user_project])
  @user_project.user_id = params[:user_id]
  @user_project.project_id = params[:project_id]
  if @user_project.save

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = 1
---
def index
  @user_projects = current_user.user_projects.all

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."id" = ? LIMIT 1  [["id", "1"]]
---
def show
  @user_project = UserProject.find(params[:id])

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "user_projects" WHERE "user_projects"."id" = ?  [["id", 1]]
---
def destroy
  @user_project = UserProject.find(params[:id])
  @user_project.destroy