app/controllers/user_skill_controller.rb

INSERT INTO "user_skills" ("created_at", "skill_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 09 Dec 2011 20:01:24 UTC +00:00], ["skill_id", nil], ["updated_at", Fri, 09 Dec 2011 20:01:24 UTC +00:00], ["user_id", nil]]
---
def create
  @user_skill = UserSkill.new(params[:user_skill])
  @user_skill.user_id = params[:user_id]
  @user_skill.skill_id = params[:skill_id]
  if @user_skill.save